[
  {
    "id": "1",
    "username": "astro_seeker",
    "comment": "Just discovered the Kaal Chakr feature and I'm blown away! The interactive time wheel shows exactly how planetary movements affect my daily life. This is revolutionary!",
    "date": "2024-03-25T10:30:00.000Z",
    "likes": 24
  },
  {
    "id": "2",
    "username": "vedic_wisdom",
    "comment": "The birth chart analysis is so detailed and accurate. It revealed aspects of my personality I never understood before. The AI integration with traditional Vedic knowledge is brilliant.",
    "date": "2024-03-24T15:45:00.000Z",
    "likes": 18
  },
  {
    "id": "3",
    "username": "cosmic_explorer",
    "comment": "Love how the app explains complex astrological concepts in simple terms. The daily guidance feature has become part of my morning routine. Highly recommended!",
    "date": "2024-03-24T09:20:00.000Z",
    "likes": 31
  },
  {
    "id": "4",
    "username": "spiritual_journey",
    "comment": "The gemstone recommendations based on my planetary positions have brought such positive energy into my life. The effects were noticeable within weeks!",
    "date": "2024-03-23T14:15:00.000Z",
    "likes": 22
  },
  {
    "id": "5",
    "username": "karma_believer",
    "comment": "Finally, an astrology app that combines ancient wisdom with modern technology. The predictions are incredibly accurate and the interface is beautiful.",
    "date": "2024-03-23T11:30:00.000Z",
    "likes": 27
  },
  {
    "id": "6",
    "username": "planet_watcher",
    "comment": "The compatibility analysis helped me understand my relationship dynamics better. My partner and I now communicate more effectively thanks to these insights.",
    "date": "2024-03-22T16:45:00.000Z",
    "likes": 19
  },
  {
    "id": "7",
    "username": "mystic_mind",
    "comment": "The career guidance feature is spot-on! I changed my job based on the planetary recommendations and it's been the best decision of my professional life.",
    "date": "2024-03-22T13:20:00.000Z",
    "likes": 35
  },
  {
    "id": "8",
    "username": "star_gazer",
    "comment": "I've been using astrology apps for years, but nothing comes close to Melooha's accuracy and depth. The Kaal Chakr visualization is mesmerizing!",
    "date": "2024-03-21T10:15:00.000Z",
    "likes": 28
  },
  {
    "id": "9",
    "username": "divine_timing",
    "comment": "The timing recommendations for important decisions have been incredibly helpful. I planned my wedding date using the app and everything went perfectly!",
    "date": "2024-03-21T08:30:00.000Z",
    "likes": 41
  },
  {
    "id": "10",
    "username": "chakra_aligned",
    "comment": "The health predictions and remedies have improved my well-being significantly. The personalized mantras and meditation suggestions are powerful.",
    "date": "2024-03-20T17:25:00.000Z",
    "likes": 23
  },
  {
    "id": "11",
    "username": "cosmic_student",
    "comment": "As someone new to Vedic astrology, this app has been an incredible learning tool. The explanations are clear and the insights are profound.",
    "date": "2024-03-20T14:40:00.000Z",
    "likes": 16
  },
  {
    "id": "12",
    "username": "lunar_cycles",
    "comment": "The moon phase guidance has helped me align my activities with natural rhythms. I feel more balanced and productive following these recommendations.",
    "date": "2024-03-19T12:10:00.000Z",
    "likes": 29
  },
  {
    "id": "13",
    "username": "saturn_return",
    "comment": "Going through my Saturn return and this app has been a lifesaver! The guidance and remedies have helped me navigate this challenging period with grace.",
    "date": "2024-03-19T09:55:00.000Z",
    "likes": 33
  },
  {
    "id": "14",
    "username": "mercury_retrograde",
    "comment": "The planetary transit alerts are so helpful! I now plan my important communications and travel around Mercury retrograde periods. No more mishaps!",
    "date": "2024-03-18T15:30:00.000Z",
    "likes": 26
  },
  {
    "id": "15",
    "username": "jupiter_blessings",
    "comment": "The financial astrology section helped me time my investments perfectly. Following Jupiter's transit recommendations, my portfolio has grown significantly!",
    "date": "2024-03-18T11:20:00.000Z",
    "likes": 38
  },
  {
    "id": "16",
    "username": "venus_love",
    "comment": "Met my soulmate during the Venus period recommended by the app! The love compatibility analysis confirmed we're perfect for each other. Thank you Melooha!",
    "date": "2024-03-17T13:45:00.000Z",
    "likes": 42
  },
  {
    "id": "17",
    "username": "mars_energy",
    "comment": "The energy level predictions based on Mars transits help me plan my workouts and important projects. I'm more productive when I follow these guidelines.",
    "date": "2024-03-17T10:15:00.000Z",
    "likes": 21
  },
  {
    "id": "18",
    "username": "rahu_ketu",
    "comment": "The shadow planet analysis opened my eyes to karmic patterns I never understood. The remedies for Rahu-Ketu effects have brought clarity to my life.",
    "date": "2024-03-16T16:30:00.000Z",
    "likes": 25
  },
  {
    "id": "19",
    "username": "sun_sign_plus",
    "comment": "This goes way beyond sun sign astrology! The detailed analysis of all planetary positions gives such a complete picture of my cosmic blueprint.",
    "date": "2024-03-16T14:20:00.000Z",
    "likes": 30
  },
  {
    "id": "20",
    "username": "moon_child",
    "comment": "The emotional patterns analysis based on my moon sign has helped me understand my feelings better. I'm more emotionally balanced now.",
    "date": "2024-03-15T12:40:00.000Z",
    "likes": 24
  },
  {
    "id": "21",
    "username": "rising_sign",
    "comment": "Finally understood why people perceive me differently than I see myself! The ascendant analysis explained everything. This app is incredibly insightful.",
    "date": "2024-03-15T09:25:00.000Z",
    "likes": 27
  },
  {
    "id": "22",
    "username": "house_systems",
    "comment": "The detailed house analysis shows exactly which life areas are highlighted at different times. I can now focus my energy more effectively.",
    "date": "2024-03-14T17:10:00.000Z",
    "likes": 19
  },
  {
    "id": "23",
    "username": "dasha_periods",
    "comment": "The Dasha system predictions are incredibly accurate! I'm in my Venus Dasha and everything related to creativity and relationships is flourishing.",
    "date": "2024-03-14T15:35:00.000Z",
    "likes": 32
  },
  {
    "id": "24",
    "username": "yogas_combinations",
    "comment": "Discovered I have several powerful yogas in my chart that I never knew about! The app explained how to activate these combinations for success.",
    "date": "2024-03-13T11:50:00.000Z",
    "likes": 28
  },
  {
    "id": "25",
    "username": "remedial_measures",
    "comment": "The remedial measures suggested are practical and effective. The simple daily rituals have brought noticeable positive changes in my life.",
    "date": "2024-03-13T08:15:00.000Z",
    "likes": 26
  },
  {
    "id": "26",
    "username": "family_astrology",
    "comment": "Used the family compatibility feature to understand dynamics between family members. It's helped us communicate better and resolve conflicts.",
    "date": "2024-03-12T16:45:00.000Z",
    "likes": 23
  },
  {
    "id": "27",
    "username": "child_astrology",
    "comment": "The children's astrology section helped me understand my kids' natural talents and challenges. I can now support their growth more effectively.",
    "date": "2024-03-12T13:30:00.000Z",
    "likes": 31
  },
  {
    "id": "28",
    "username": "business_timing",
    "comment": "Launched my startup during the auspicious period recommended by the app. The business is thriving beyond my expectations! Timing is everything.",
    "date": "2024-03-11T10:20:00.000Z",
    "likes": 39
  },
  {
    "id": "29",
    "username": "travel_astrology",
    "comment": "The travel recommendations based on planetary positions have made my trips more successful and enjoyable. Even found great business opportunities!",
    "date": "2024-03-11T14:55:00.000Z",
    "likes": 22
  },
  {
    "id": "30",
    "username": "education_guidance",
    "comment": "The education astrology helped me choose the right course for higher studies. I'm excelling in subjects that align with my planetary strengths.",
    "date": "2024-03-10T12:10:00.000Z",
    "likes": 25
  },
  {
    "id": "31",
    "username": "health_astrology",
    "comment": "The health predictions warned me about potential issues months in advance. I took preventive measures and avoided serious health problems.",
    "date": "2024-03-10T09:40:00.000Z",
    "likes": 34
  },
  {
    "id": "32",
    "username": "spiritual_growth",
    "comment": "The spiritual guidance based on my chart has accelerated my spiritual journey. The recommended practices resonate deeply with my soul.",
    "date": "2024-03-09T15:25:00.000Z",
    "likes": 29
  },
  {
    "id": "33",
    "username": "past_life_karma",
    "comment": "The karmic analysis revealed patterns from past lives that explain current challenges. Understanding this has brought peace and direction to my life.",
    "date": "2024-03-09T11:15:00.000Z",
    "likes": 36
  },
  {
    "id": "34",
    "username": "muhurta_timing",
    "comment": "Used the Muhurta feature to time important events and ceremonies. Everything went smoothly and the results exceeded expectations!",
    "date": "2024-03-08T13:50:00.000Z",
    "likes": 27
  },
  {
    "id": "35",
    "username": "gem_therapy",
    "comment": "The gemstone therapy recommendations have been life-changing. Wearing the suggested stones has improved my confidence and success rate dramatically.",
    "date": "2024-03-08T10:30:00.000Z",
    "likes": 33
  },
  {
    "id": "36",
    "username": "mantra_power",
    "comment": "The personalized mantras based on my planetary positions are incredibly powerful. I feel the positive vibrations every time I chant them.",
    "date": "2024-03-07T16:20:00.000Z",
    "likes": 28
  },
  {
    "id": "37",
    "username": "vastu_harmony",
    "comment": "The Vastu recommendations for my home and office have created such positive energy. Everyone who visits comments on the peaceful atmosphere.",
    "date": "2024-03-07T14:05:00.000Z",
    "likes": 24
  },
  {
    "id": "38",
    "username": "color_therapy",
    "comment": "Following the color recommendations based on planetary influences has boosted my mood and energy levels. Such a simple yet effective remedy!",
    "date": "2024-03-06T12:35:00.000Z",
    "likes": 21
  },
  {
    "id": "39",
    "username": "number_vibrations",
    "comment": "The numerology integration with Vedic astrology provides such comprehensive insights. My lucky numbers have indeed brought good fortune!",
    "date": "2024-03-06T09:45:00.000Z",
    "likes": 26
  },
  {
    "id": "40",
    "username": "eclipse_effects",
    "comment": "The eclipse predictions and precautions have helped me navigate these intense periods smoothly. The guidance is always spot-on and practical.",
    "date": "2024-03-05T17:15:00.000Z",
    "likes": 30
  },
  {
    "id": "41",
    "username": "festival_timing",
    "comment": "Love how the app explains the astrological significance of festivals and suggests the best ways to celebrate for maximum benefits. Very enlightening!",
    "date": "2024-03-05T15:40:00.000Z",
    "likes": 23
  },
  {
    "id": "42",
    "username": "dream_analysis",
    "comment": "The dream interpretation feature based on planetary influences has helped me understand subconscious messages. My dreams now make perfect sense!",
    "date": "2024-03-04T11:25:00.000Z",
    "likes": 25
  },
  {
    "id": "43",
    "username": "meditation_guide",
    "comment": "The personalized meditation techniques based on my chart have deepened my practice significantly. I achieve deeper states of consciousness now.",
    "date": "2024-03-04T08:50:00.000Z",
    "likes": 32
  },
  {
    "id": "44",
    "username": "chakra_balance",
    "comment": "The chakra balancing recommendations aligned with planetary positions have harmonized my energy centers. I feel more balanced and centered.",
    "date": "2024-03-03T16:30:00.000Z",
    "likes": 27
  },
  {
    "id": "45",
    "username": "ayurveda_astrology",
    "comment": "The integration of Ayurveda with astrology is brilliant! The dietary and lifestyle recommendations based on my constitution have improved my health.",
    "date": "2024-03-03T13:15:00.000Z",
    "likes": 29
  },
  {
    "id": "46",
    "username": "yoga_practice",
    "comment": "The yoga recommendations based on planetary positions have enhanced my practice. Different asanas work better during different planetary periods!",
    "date": "2024-03-02T10:40:00.000Z",
    "likes": 24
  },
  {
    "id": "47",
    "username": "pranayama_power",
    "comment": "The breathing techniques suggested for my planetary imbalances have been transformative. My stress levels have decreased significantly.",
    "date": "2024-03-02T14:20:00.000Z",
    "likes": 26
  },
  {
    "id": "48",
    "username": "crystal_healing",
    "comment": "The crystal recommendations work in perfect harmony with the gemstone suggestions. My energy field feels more protected and positive.",
    "date": "2024-03-01T12:05:00.000Z",
    "likes": 31
  },
  {
    "id": "49",
    "username": "sound_healing",
    "comment": "The sound therapy recommendations using specific frequencies for planetary healing have been incredibly effective. I feel more harmonious.",
    "date": "2024-03-01T09:30:00.000Z",
    "likes": 22
  },
  {
    "id": "50",
    "username": "cosmic_consciousness",
    "comment": "This app has elevated my understanding of cosmic consciousness. I now see how everything is interconnected through planetary influences. Truly enlightening!",
    "date": "2024-02-29T15:45:00.000Z",
    "likes": 38
  }
]
